In [38]:
import numpy as np
import pandas as pd
import scipy as sc
import matplotlib.pyplot as plt
%matplotlib inline

df = pd.read_csv("wellcome.csv", encoding ='cp1252')
df.head()

,PMID/PM,Publisher,Journal tit,Article titl,COST (£) charged to Wellcome (inc VAT when charged)
0,NaN,CUP,Psycholog,Reduced,£0.00
1,PMC36795,ACS,Biomacro,Structural,£2381.04
2,23043264,ACS,J Med Che,Fumaroyl,£642.56
3,23438330,ACS,J Med Che,Orvinols,£669.64
4,23438216,ACS,J Org Che,Regiosele,£685.88

In [39]:
new_df = df.dropna()
new_df.head()

,PMID/PM,Publisher,Journal tit,Article titl,COST (£) charged to Wellcome (inc VAT when charged)
1,PMC36795,ACS,Biomacro,Structural,£2381.04
2,23043264,ACS,J Med Che,Fumaroyl,£642.56
3,23438330,ACS,J Med Che,Orvinols,£669.64
4,23438216,ACS,J Org Che,Regiosele,£685.88
5,PMC35794,ACS,Journal of,Comparat,£2392.20

## orders.item_price.str.replace('$', '').astype(float).mean()

In [11]:
new_df['Journal tit'].value_counts().head()

Journal of    277
PLoS One       91
PLoS ONE       62
Proceedin      39
Molecular      35
Name: Journal tit, dtype: int64

## I want to rename the COST (£) charged to Wellcome (inc VAT when charged), to just Cost for simplicity.

In [44]:
new_df.rename(columns = {'COST (£) charged to Wellcome (inc VAT when charged)': 'Cost'}, inplace=True)

C:\Users\MESUPERSEXAYYY\Anaconda3\lib\site-packages\pandas\core\frame.py:3027: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

In [45]:
new_df.columns

Index(['PMID/PM', 'Publisher', 'Journal tit', 'Article titl', 'Cost'], dtype='object')

## new_df.head(3).drop('Time", axis=1')

In [71]:
new_df.Cost.str.replace('£', ''),('$', '').astype(float).mean()

AttributeError: 'tuple' object has no attribute 'astype'

In [70]:
new_df.str.contains(^['A-Z']['\d']$, axis=0, inplace=True)

SyntaxError: invalid syntax (<ipython-input-70-27a258aef3bf>, line 1)

In [76]:
new_df['Cost'].str.replace('£', ''),('$', '').astype(float).mean()

SyntaxError: invalid syntax (<ipython-input-76-3984969ec539>, line 1)